cmsis-svd/cmsis-svd/data/Fujitsu/MB9AF12xK.xml
        <!-- REGISTER "IRQ32MON" -->
        <register>
          <name>IRQ32MON</name>
          <description>IRQ32 Batch Read Register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ33MON" -->
        <register>
          <name>IRQ33MON</name>
          <description>IRQ33 Batch Read Register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ34MON" -->
        <register>
          <name>IRQ34MON</name>
          <description>IRQ34 Batch Read Register</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ35MON" -->
        <register>
          <name>IRQ35MON</name>
          <description>IRQ35 Batch Read Register</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ36MON" -->
        <register>
          <name>IRQ36MON</name>
          <description>IRQ36 Batch Read Register</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ37MON" -->
        <register>
          <name>IRQ37MON</name>
          <description>IRQ37 Batch Read Register</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ38MON" -->
        <register>
          <name>IRQ38MON</name>
          <description>IRQ38 Batch Read Register</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ39MON" -->
        <register>
          <name>IRQ39MON</name>
          <description>IRQ39 Batch Read Register</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ40MON" -->
        <register>
          <name>IRQ40MON</name>
          <description>IRQ40 Batch Read Register</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ41MON" -->
        <register>
          <name>IRQ41MON</name>
          <description>IRQ41 Batch Read Register</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ42MON" -->
        <register>
          <name>IRQ42MON</name>
          <description>IRQ42 Batch Read Register</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ43MON" -->
        <register>
          <name>IRQ43MON</name>
          <description>IRQ43 Batch Read Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ44MON" -->
        <register>
          <name>IRQ44MON</name>
          <description>IRQ44 Batch Read Register</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ45MON" -->
        <register>
          <name>IRQ45MON</name>
          <description>IRQ45 Batch Read Register</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ46MON" -->
        <register>
          <name>IRQ46MON</name>
          <description>IRQ46 Batch Read Register</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ47MON" -->
        <register>
          <name>IRQ47MON</name>
          <description>IRQ47 Batch Read Register</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0800</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLASHINT" -->
            <field>
              <name>FLASHINT</name>
              <description>"RDY, HANG interrupt request for flash "</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCINTSEL0" -->
        <register>
          <name>RCINTSEL0</name>
          <description>Interrupt Factor Selection Register 0</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTSEL3" -->
            <field>
              <name>INTSEL3</name>
              <description>select the interrupt factor of the interrupt vector No.22.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL2" -->
            <field>
              <name>INTSEL2</name>
              <description>select the interrupt factor of the interrupt vector No.21.</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL1" -->
            <field>
              <name>INTSEL1</name>
              <description>select the interrupt factor of the interrupt vector No.20.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL0" -->
            <field>
              <name>INTSEL0</name>
              <description>select the interrupt factor of the interrupt vector No.19.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCINTSEL1" -->
        <register>
          <name>RCINTSEL1</name>
          <description>Interrupt Factor Selection Register 1</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTSEL7" -->
            <field>
              <name>INTSEL7</name>
              <description>select the interrupt factor of the interrupt vector No.26.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL6" -->
            <field>
              <name>INTSEL6</name>
              <description>select the interrupt factor of the interrupt vector No.25.</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL5" -->
            <field>
              <name>INTSEL5</name>
              <description>select the interrupt factor of the interrupt vector No.24.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL4" -->
            <field>
              <name>INTSEL4</name>
              <description>select the interrupt factor of the interrupt vector No.23.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
